       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPY-USER-A.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY EMPREC.
       PROCEDURE DIVISION.
       MAIN.
           MOVE 1 TO EMP-ID
           STOP RUN.
