       IDENTIFICATION DIVISION.
       PROGRAM-ID. COPY-USER-B.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY EMPREC.
       PROCEDURE DIVISION.
       MAIN.
           MOVE "ANN" TO EMP-NAME
           STOP RUN.
