       01 RAW-INPUT PIC X(4).
       01 NUM-DATA REDEFINES RAW-INPUT.
          05 NUM1    PIC 9(2).
          05 NUM2    PIC 9(2).
       01 MAX-NUM    PIC 9(2).
